## Plan Result (demo-demo)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.demo-internal-hmcts-net.azurerm_private_dns_zone.zone[0]
  * module.demo-internal-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-nonprodi&#34;]
* Delete
  * module.demo-hmcts-justice-gov-uk.azurerm_private_dns_zone.zone[0]
  * module.demo-hmcts-justice-gov-uk.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-nonprodi&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-hmcts-justice-gov-uk.azurerm_private_dns_zone.zone[0] will be destroyed
  # (because azurerm_private_dns_zone.zone is not in configuration)
  - resource "azurerm_private_dns_zone" "zone" {
      - id                                                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.hmcts.justice.gov.uk" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "demo.hmcts.justice.gov.uk" -> null
      - number_of_record_sets                                 = 1 -> null
      - resource_group_name                                   = "core-infra-intsvc-rg" -> null
      - tags                                                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "demo.hmcts.justice.gov.uk." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.demo-hmcts-justice-gov-uk.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-nonprodi"] will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.vnet_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      - id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/demo.hmcts.justice.gov.uk/virtualNetworkLinks/private-dns-resolver-uksouth-vnet-nonprodi" -> null
      - name                  = "private-dns-resolver-uksouth-vnet-nonprodi" -> null
      - private_dns_zone_name = "demo.hmcts.justice.gov.uk" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "core-infra-intsvc-rg" -> null
      - tags                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-private-dns"
          - "businessArea" = "CFT"
          - "criticality"  = "Medium"
          - "environment"  = "demo"
        } -> null
      - virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/private-dns-resolver-uksouth-nonprodi/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-nonprodi" -> null
    }

  # module.demo-internal-hmcts-net.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "demo.internal.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.demo-internal-hmcts-net.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-nonprodi"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-nonprodi"
      + private_dns_zone_name = "demo.internal.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + virtual_network_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/private-dns-resolver-uksouth-nonprodi/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-nonprodi"
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":482,"Program":"tfcmt","SHA1":"","Target":"demo-demo","Vars":{}} -->